#include "TitovNLCompDef.cpp"
#include <iostream>
#include <io.h>
#include <fcntl.h>

пользуясь ёпрст база;

количество main() {
    //Русская локализация консоли (не работает).
    /*количество неругайся = 0;
    неругайся = ярусский(файл(stdout), _O_U16TEXT);
    неругайся = ярусский(файл(stdin), _O_U16TEXT);
    неругайся = ярусский(файл(stderr), _O_U16TEXT);*/
    скажипоанглийски << "Hello mf!" << крыса;
    скажипоанглийски << "Enter number: ";
    количество ввод = 0;
    понял >> ввод;
    скажипоанглийски << крыса;
    тычто(ввод == 0) скажипоанглийски << "Wow!" << крыса;
    непонял тычто(ввод == 69) скажипоанглийски << "Vay be!" << крыса;
    непонял тычто(ввод == 777) скажипоанглийски << "I don't believe you!" << крыса;
    непонял тычто(ввод == 666) скажипоанглийски << "Amazing!" << крыса;
    непонял скажипоанглийски << "Trash!" << крыса;
    выбросить 0;
}